IdeaRS.OpenModel.Material.BoltAssembly
Bolt assembly

IdeaRS.OpenModel.Material.BoltAssembly.Name
Name of bolt assembly

IdeaRS.OpenModel.Material.BoltAssembly.BoltGrade
Bolt grade

IdeaRS.OpenModel.Material.BoltAssembly.Diameter
Bolt diameter

IdeaRS.OpenModel.Material.BoltAssembly.Borehole
Size of borehole

IdeaRS.OpenModel.Material.BoltAssembly.HeadDiameter
Diameter of the head

IdeaRS.OpenModel.Material.BoltAssembly.DiagonalHeadDiameter
Second diameter of the head

IdeaRS.OpenModel.Material.BoltAssembly.HeadHeight
Thickness of head

IdeaRS.OpenModel.Material.BoltAssembly.GrossArea
Gross cross-section area

IdeaRS.OpenModel.Material.BoltAssembly.TensileStressArea
Tensile stress area

IdeaRS.OpenModel.Material.BoltAssembly.NutThickness
Thickness of Nut

IdeaRS.OpenModel.Material.BoltAssembly.WasherThickness
Thickness of washer

IdeaRS.OpenModel.Material.BoltAssembly.WasherAtHead
Washer at head side of bolt assembly

IdeaRS.OpenModel.Material.BoltAssembly.WasherAtNut
Is washer at Nut side of bolt assembly